/**
 * <h2>动物类系列需求描述</h2>
 * <ul>
 *   <li>鲸鱼是水生哺乳动物，可以游泳，不能行走，用肺呼吸，用乳汁养育孩子，胎生。</li>
 *   <li>蝙蝠是陆生哺乳动物，可以飞翔，用肺呼吸，用乳汁养育孩子，胎生。</li>
 *   <li>猴子是陆生哺乳动物，不会游泳，飞不起来，可以行走与爬树，胎生，乳汁养育后代。</li>
 *   <li>猫是陆生哺乳动物，不会游泳，飞不起来，可以行走与爬树，胎生，乳汁养育后代。</li>
 *   <li>鲨鱼是水生鱼类，可以游泳，用腮呼吸，卵生，产卵后就撒手不管了，不养育后代。</li>
 *   <li>企鹅是鸟类，可以行走与游泳，不会飞，卵生，孵化后父母共同照顾养育后代。</li>
 *   <li>天鹅是鸟类，可以行走、游泳与飞翔，卵生，双亲负责养育后代。</li>
 * </ul>
 *
 * <p>请抽象出一个类系列，包含若干必要的父类、子类与接口，模拟以上描述的这些动物。要包含必要的属性与方法，包括以上描述中明确提到的，及未提及但隐含的一些常识。 </p>
 * <ul>
 *   <li>属性候选项：名称，种类名称，出生日期，颜色，体重，性别，体温类型（冷血、温血），等等</li>
 *   <li>行为候选项：呼吸，行走，游泳，飞翔，生育后代，哺育后代，进食，等等</li>
 * </ul>
 * <p>
 * 本例涉及的一些英语单词如下：
 * <p>
 * <ul>
 *   <li>行走walk，飞翔fly，游泳swim，物种名称species name，进食eat，呼吸breath，生殖reproduce，哺育照顾后代care For Offspring</li>
 *   <li>哺乳动物mammal，恒温动物endotherm，蝙蝠bat，猴子monkey，鲸鱼whale，天鹅swan，企鹅penguin，鲨鱼shark，脊椎动物vertebrate</li>
 * </ul>
 */
package cn.edu.lcu.cs.javaprogramming.oop.animal;